ErikHurum/S2Prog/IO/ANZB_ATmega1281/Src/RS485.c
}

/*************************************************************************
*
*  Check the incoming packages from AN_SGCNV / WIS
*
*************************************************************************/
void Usart16552CheckPackage(char ch) {

    unsigned short pointer = 4;
    char count_out  = MAX_PROT_CMD;// max command
    char more       = true;

    do {
        if (!CheckActionUart16552(ch, pointer)) {
            more = false;                          // terminate while loop
        }
        pointer += UART16552[ch].pRxBuffer[pointer + 1] + 2;            // Point to a command cmd hb/lb
        if (!--count_out) {
            more = false;
        }
    } while (more && (pointer < UART16552[ch].RxPacklen - 3));
    GoToSyncUART16552(ch);
}



/*************************************************************************
*
*  Check action on received data from AN_SGCNV
*
*************************************************************************/
char CheckActionUart16552(char ch, unsigned short pointer) {

    char retval = true;

    switch (UART16552[ch].pRxBuffer[pointer]) {    // check action

    case ANP1_REP_MP_DATA :                              // Measured pressure data
    case ANP1_REP_MT_DATA :                              // Measured temperature data
    case ANP1_REP_MO_DATA :                              // Measured "other" data
        ReceivePTOData(ch, pointer + 2);                     // receive package
        break;
    case ANP1_REP_WH_DATA :                              // Measured "washtrack and high level" data
        ReceiveWHData(ch, pointer + 2);                     // receive package
        break;
    case ANP1_REP_RP_DATA :                              // Raw pressure data
    case ANP1_REP_RT_DATA :                              // Raw temp. data
    case ANP1_REP_RO_DATA :                              // Raw "other" data
        ReceiveRData(ch, pointer + 2);              // receive package
        break;
    case ANP1_REP_CAL_DATA :                             // Raw "other" data
        ReceiveCData(ch, pointer + 2);              // receive package
        break;

    case ANP1_REP_CARD_STAT :                             // card status package
        ReceiveCardStatus(ch, pointer + 2);          // receive package
        break;

    case ANP1_REP_CONFIG :                             // config data
        ReceiveConfigData(ch, pointer + 2);          // receive package
        break;

    case ANP1_REP_EEP_DATA :                             // card eeprome
        ReceiveCardEEPROMData(ch, pointer + 2);          // receive package
        break;

    case ANP1_REP_WIS_STAT :                             // Card status from WIS
        ReceiveWISStatus(ch, pointer + 2);            // receive package
        break;

    case ANP1_REP_WIS_XDATA :                             // Card WIS protocol
        ReceiveWISXData(ch, pointer + 2);            // receive package
        break;

    case ANP1_REP_WIS_DATA :                             // Data from WIS
        ReceiveWISData(ch, pointer + 2);             // receive package
        break;
    case ANP1_REP_GODA_DATA:
        ReceiveRadarData(ch, pointer + 2);             // receive package
        break;
    case ANP1_REP_GODA_INFO:
        ReceiveRadarInfo(ch, pointer + 2);             // receive package
        break;
    case ANP1_ECMD_NMDRQACK :                             // No more data, send ack.
    case ANP1_ECMD_NMDWOACK :                         // No more data
        retval = false;
        break;
    }
    return retval;
}

/*************************************************************************
*
*  Receive card status from WIS
*
*************************************************************************/
void ReceiveWISStatus(char ch, unsigned short pointer) {

    TData.RS4.TargetStatusSWVer[(ch * 4) + PortPair] |= UART16552[ch].pRxBuffer[pointer];
    TData.RS4.TargetStatusAddress[(ch * 4) + PortPair] = UART16552[ch].pRxBuffer[pointer + 1];
    if (UART16552[ch].pRxBuffer[pointer + 4]) {
        TData.RS4.TargetStatusAddress[(ch * 4) + PortPair] |= 0x80;
    }
}

/*************************************************************************
*
*  Receive WIS protocol data
*
*************************************************************************/
void ReceiveWISXData(char ch, unsigned short pointer) {

    char i;

    switch (UART16552[ch].pRxBuffer[pointer++]) {
    case 115:                                     // Serial number
        TData.RS4.FromTargetBuffer[ch][0] = true;
        TData.RS4.FromTargetBuffer[ch][1] = (ch * 4) + PortPair;
        for (i = 2; i < (4 + 2); i++) {
            TData.RS4.FromTargetBuffer[ch][i] = UART16552[ch].pRxBuffer[pointer++];
        }
        break;
    default:
        break;
    }
}

/*************************************************************************
*
*  Receive measured data from WIS
*
*************************************************************************/
void ReceiveWISData(char ch, unsigned short pointer) {

    TData.RS4.Result[(ch * 4) + PortPair][0] = (float)UART16552[ch].pRxBuffer[pointer + 0];       // Water detected
    TData.RS4.Result[(ch * 4) + PortPair][1] = (float)((UART16552[ch].pRxBuffer[pointer + 1] << 8) // Temperature
                                                       + UART16552[ch].pRxBuffer[pointer + 2]) / 10.0;
    TData.RS4.TargetSetup1[(ch * 4) + PortPair][0] = UART16552[ch].pRxBuffer[pointer + 3];         // Status
    TData.RS4.TargetSetup2[(ch * 4) + PortPair][0] = 0;                                            // Unused
}


/*************************************************************************
*
*  Receive measured data from Radar
*
*************************************************************************/
void ReceiveRadarData(char ch, unsigned short pointer) {
    float *Data1 = (float *)&UART16552[ch].pRxBuffer[pointer + 0];
    float *Data2 = (float *)&UART16552[ch].pRxBuffer[pointer + 4];

    TData.RS4.Result[(ch * 4) + PortPair][0] = *Data1;       // Distance
    TData.RS4.Result[(ch * 4) + PortPair][1] = *Data2;      // Level
    TData.RS4.TargetSetup1[(ch * 4) + PortPair][0] = UART16552[ch].pRxBuffer[pointer + 8];         // Status
    TData.RS4.TargetSetup2[(ch * 4) + PortPair][0] = UART16552[ch].pRxBuffer[pointer + 9];         // Unused???
}


/*************************************************************************
*
*  Receive Serial number and version information from Radar
*
*************************************************************************/
void ReceiveRadarInfo(char ch, unsigned short pointer) {
    // TData.RS4.SerialNumber[(ch * 4) + PortPair] = atol((const char *)&UART16552[ch].pRxBuffer[pointer + 0]);
    TData.RS4.TargetStatusSWVer[(ch * 4) + PortPair] = *((long *)&UART16552[ch].pRxBuffer[pointer + 10]);
}

/*************************************************************************
*
*  Receive pressure measured data from AN_SGCNV
*
*************************************************************************/
void ReceivePTOData(char ch, unsigned short pointer) {

