ErikHurum/S2Prog/IO/ANZB_ATmega1281/Src/RS485.c
    unsigned short pnt, ADCh;
    short packlen;

    packlen = UART16552[ch].pRxBuffer[pointer - 1];

    OS_Use(&UARTSEND);    // Do not write to buffer while the buffer can be read by other

    if (packlen > 0) {
        for (pnt = 0; pnt < packlen; pnt += 6) {
            ADCh = UART16552[ch].pRxBuffer[pointer + pnt];
            if (ADCh < 14) {
                TData.RS4.TargetSetup1[(ch * 4) + PortPair][ADCh] = UART16552[ch].pRxBuffer[pointer + pnt + 1];
                *((float *)&TData.RS4.Result[(ch * 4) + PortPair][ADCh]) = *((float *)&UART16552[ch].pRxBuffer[pointer + pnt + 2]);
            }
        }
    }
    OS_Unuse(&UARTSEND);
}
/*************************************************************************
*
*  Receive Wash Track and High Level data from AN_SGCNV
*
*************************************************************************/
void ReceiveWHData(char ch, unsigned short pointer) {

    // Fixed packet length
    //short packlen;

    //packlen = UART16552[ch].pRxBuffer[pointer - 1];

    OS_Use(&UARTSEND);    // Do not write to buffer while the buffer can be read by other
    short Index = (ch * 4) + PortPair;
    // Check if we have time information included
    if (UART16552[ch].pRxBuffer[pointer - 1] == 4) {
        for (short pnt = 0; pnt < 3; pnt++) {
            TData.RS4.WTrackCnt[Index][pnt] = UART16552[ch].pRxBuffer[pointer + pnt];  // 4 x Wash track
        }
        // 4th WashTrack dont come
        TData.RS4.WTrackCnt[Index][3] = 0;  // Missing 4th Wash track because of BUG in H8 compiler
        TData.RS4.LevelSwitch[Index] = UART16552[ch].pRxBuffer[pointer + 3]; // Hgh levels in 5th byte
        TData.RS4.WTTime[Index] = 0;
    } else {
        for (short pnt = 0; pnt < 4; pnt++) {
            TData.RS4.WTrackCnt[Index][pnt] = ((unsigned short *)&UART16552[ch].pRxBuffer[pointer])[pnt];  // 4 x Wash track
        }
        TData.RS4.LevelSwitch[Index] = UART16552[ch].pRxBuffer[pointer + 8]; // Hgh levels in 9th byte
        TData.RS4.WTTime[Index] = *((unsigned short *)&UART16552[ch].pRxBuffer[pointer + 9]);  // WashTrack time in 10th and 11th bytes
    }
    TData.RS4.WHDataAvailable |= 0x01 << ((ch * 4) + PortPair);
    OS_Unuse(&UARTSEND);
}


/************************************************************************
*
*  Receive raw data for pressure, temp and other from AN_SGCNV
*
*************************************************************************/
void ReceiveRData(char ch, unsigned short pointer) {

    char pnt, ADCh;
    short packlen;

    packlen = UART16552[ch].pRxBuffer[pointer - 1];

    if (packlen > 0) {
        for (pnt = 0; pnt < packlen; pnt += 4) {
            ADCh = UART16552[ch].pRxBuffer[pointer + pnt];
            if (ADCh < 14) {
                TData.RS4.TargetSetup1[(ch * 4) + PortPair][ADCh] = UART16552[ch].pRxBuffer[pointer + pnt + 1];
                *((short *)&TData.RS4.Raw[(ch * 4) + PortPair][ADCh]) = *((short *)&UART16552[ch].pRxBuffer[pointer + pnt + 2]);
            }
        }
    }
}

/*************************************************************************
*
*  Receive cal data  from AN_SGCNV
*
*************************************************************************/
void ReceiveCData(char ch, unsigned short pointer) {

    char pnt, ADCh;
    short packlen;

    packlen = UART16552[ch].pRxBuffer[pointer - 1];

    if (packlen > 0) {
        for (pnt = 0; pnt < packlen; pnt += 4) {
            ADCh = UART16552[ch].pRxBuffer[pointer + pnt];
            if (ADCh < 14) {
                TData.RS4.TargetSetup1[(ch * 4) + PortPair][ADCh] = UART16552[ch].pRxBuffer[pointer + pnt + 1];
                *((short *)&TData.RS4.Cal[(ch * 4) + PortPair][ADCh]) = *((short *)&UART16552[ch].pRxBuffer[pointer + pnt + 2]);
            }
        }
    }
}

/*************************************************************************
*
*  Receive card status  from AN_SGCNV
*
*************************************************************************/
void ReceiveCardStatus(char ch, unsigned short pointer) {

    TData.RS4.TargetStatusSWVer[(ch * 4) + PortPair] = UART16552[ch].pRxBuffer[pointer];
    TData.RS4.TargetStatusAddress[(ch * 4) + PortPair] = UART16552[ch].pRxBuffer[pointer + 1];
}

/*************************************************************************
*
*  Receive config data from AN_SGCNV
*
*************************************************************************/
void ReceiveConfigData(char ch, unsigned short pointer) {

    char i, ADCh;

    for (i = 0; i < 14; i++) {
        ADCh = UART16552[ch].pRxBuffer[pointer++];
        if (ADCh < 14) {
            TData.RS4.TargetSetup1[(ch * 4) + PortPair][ADCh] = UART16552[ch].pRxBuffer[pointer];
            TData.RS4.TargetSetup2[(ch * 4) + PortPair][ADCh] = UART16552[ch].pRxBuffer[pointer + 1];
        }
        pointer += 2;
    }
}

/*************************************************************************
*
*  Receive eeprom data from AN_SGCNV
*
*************************************************************************/
void ReceiveCardEEPROMData(char ch, unsigned short pointer) {

    short i;

    TData.RS4.FromTargetBuffer[ch][0] = true;
    TData.RS4.FromTargetBuffer[ch][1] = (ch * 4) + PortPair;
    for (i = 2; i < (41 + 2); i++) {
        TData.RS4.FromTargetBuffer[ch][i] = UART16552[ch].pRxBuffer[pointer++];
    }
}

/*************************************************************************
*
* Build send packet header for AN-SGCNV
*
*************************************************************************/
void Uart_BuildHeader16552(char ch) {

    UART16552[ch].RxFirst = 0;                                // Reset pointers
    UART16552[ch].RxLast = 0;
    UART16552[ch].TxLast = 0;

    UART16552[ch].pTxBuffer[0] = ANPRO1_SYN;                        /* Sync */
    UART16552[ch].pTxBuffer[1] = ANPRO1_SYN;                        /* Sync */
    UART16552[ch].pTxBuffer[2] = 0;                          /* Rx address */
    UART16552[ch].pTxBuffer[3] = MY_SGCNV_ADDR;              /* My address to AD-SGCNV */
    UART16552[ch].pTxBuffer[4] = 0;                          /* packlen HB, don't know yet */
    UART16552[ch].pTxBuffer[5] = 0;                          /* packlen LB, don't know yet */
}

/*************************************************************************
*
* Build  packet tail
*
*************************************************************************/
void Uart_BuildTail16552(char ch) {

