ErikHurum/S2Prog/IO/ANZB_ATmega1281/Src/RS485.c
        if (temp > 0 && temp <= 5000) {
            Rsp_Delay[ch] = temp;
        } else {
            Rsp_Delay[ch] = 0;
        }
    }
}

static void
__rs485_task_set_power(uint8_t ch, uint8_t on) {
    uint8_t current;

    current = (TData.RS4.PortUsed >> ch) & 0x01;

    if (current == on) {
        // no need to waste time
        return;
    }

    if (on) {
        TData.RS4.PortUsed |= (1 << ch);
    } else {
        TData.RS4.PortUsed &= ~(1 << ch);
    }
    PORTC = TData.RS4.PortUsed;

    WriteEEPROMByte(EEPROM_PORTSETUP, TData.RS4.PortUsed);
}

void
rs485_task_set_power(uint8_t ch, uint8_t on) {
    OS_Use(&UARTSEND);
    __rs485_task_set_power(ch, on);
    OS_Unuse(&UARTSEND);
}

uint8_t
rs485_task_get_power(uint8_t ch) {
    uint8_t status;

    OS_Use(&UARTSEND);
    status = (TData.RS4.PortUsed >> ch) & 0x01;
    OS_Unuse(&UARTSEND);

    return status;
}

uint8_t
rs485_task_get_sensor_type(uint8_t ch) {
    uint8_t sensor_type;

    OS_Use(&UARTSEND);
    sensor_type = (TData.RS4.SensorType[ch / 4] >> (2 * (ch % 4))) & 0x03;
    OS_Unuse(&UARTSEND);

    return sensor_type;
}

void
rs485_task_set_sensor_type(uint8_t ch, uint8_t sensor_type) {
    OS_Use(&UARTSEND);

    // clear first
    TData.RS4.SensorType[ch / 4] &= ~(0x03 << ((ch % 4) * 2));

    // set
    TData.RS4.SensorType[ch / 4] |= ((sensor_type & 0x03) << ((ch % 4) * 2));

    WriteEEPROMByte(EEPROM_PORTSETUP + 1, TData.RS4.SensorType[0]);
    WriteEEPROMByte(EEPROM_PORTSETUP + 2, TData.RS4.SensorType[1]);

    OS_Unuse(&UARTSEND);
}

static void
__rs485_task_set_rsp_delay(uint8_t port, uint16_t delay) {
    uint16_t cur_delay = Rsp_Delay[port];

    if (cur_delay == delay) {
        return;
    }

    if (delay > 5000) {
        return;
    }

    Rsp_Delay[port] = delay;

    WriteEEPROMBufferSync(EEPROM_PORTSETUP + 3 + port * 2, sizeof(uint16_t), (char *)&delay);
}

void
rs485_task_set_rsp_delay(uint8_t port, uint16_t delay) {
    OS_Use(&UARTSEND);
    __rs485_task_set_rsp_delay(port, delay);
    OS_Unuse(&UARTSEND);
}

uint16_t
rs485_task_get_rsp_delay(uint8_t port) {
    uint16_t    ret;

    OS_Use(&UARTSEND);
    ret = Rsp_Delay[port];
    OS_Unuse(&UARTSEND);

    return ret;
}

uint8_t
rs485_task_get_comm_status(uint8_t port) {
    uint16_t    ret;

    // XXX no need for lock
    ret = (TData.RS4.IOUnitStatus[port] & COMFAIL_BIT) ? 0 : 1;

    return ret;
}

uint8_t
rs485_task_get_channel_status(uint8_t port, uint8_t ch) {
    uint8_t ret;

    OS_Use(&UARTSEND);
    ret = (uint8_t)TData.RS4.TargetSetup1[port][ch];
    OS_Unuse(&UARTSEND);

    return ret;
}

int16_t
rs485_task_get_channel_value(uint8_t port, uint8_t ch) {
    float f;
    int16_t  ret;

    OS_Use(&UARTSEND);
    f = TData.RS4.Result[port][ch];
    OS_Unuse(&UARTSEND);

    ret = (int16_t)(f * 100);
    return ret;
}

int16_t
rs485_task_get_channel_raw_value(uint8_t port, uint8_t ch) {
    int16_t ret;

    OS_Use(&UARTSEND);
    ret = TData.RS4.Raw[port][ch];
    OS_Unuse(&UARTSEND);

    return ret;
}

int16_t
rs485_task_get_channel_cal_value(uint8_t port, uint8_t ch) {
    int16_t ret;

    OS_Use(&UARTSEND);
    ret = TData.RS4.Cal[port][ch];
    OS_Unuse(&UARTSEND);

    return ret;
}
#endif /* USE_MODBUS_PROTOCOL == 1 */
